[
  { "term": "Hypertension", "definition": "Chronic high blood pressure — long-term elevated blood pressure that increases load on the heart and arteries." },
  { "term": "Hypotension", "definition": "Low blood pressure — when the blood pressure is below normal values, possibly causing fainting or dizziness." },
  { "term": "Bradycardia", "definition": "Abnormally slow heart rate, often under 60 beats per minute at rest." },
  { "term": "Tachycardia", "definition": "Abnormally fast heart rate, often over 100 beats per minute at rest." },
  { "term": "Arrhythmia", "definition": "Irregular or abnormal heartbeat — heart rhythm deviates from normal sinus rhythm." },
  { "term": "Atrial Fibrillation (AFib)", "definition": "A common arrhythmia causing rapid and irregular beating of the heart's atria." },
  { "term": "Premature Ventricular Contraction (PVC)", "definition": "Extra, early heartbeats beginning in one of the heart’s ventricles, contributing to irregular rhythm." },
  { "term": "Coronary Artery Disease (CAD)", "definition": "Narrowing or blockage of coronary arteries supplying blood to heart muscle, often due to plaque buildup." },
  { "term": "Myocardial Infarction (Heart Attack)", "definition": "Death of part of the heart muscle because of severely reduced or blocked blood supply." },
  { "term": "Angina Pectoris", "definition": "Chest pain or discomfort caused by reduced blood flow to the heart muscle." },
  { "term": "Unstable Angina", "definition": "Angina that occurs unpredictably, often more severe and may signal impending myocardial infarction." },
  { "term": "Stable Angina", "definition": "Predictable chest pain triggered by exertion or stress and relieved by rest or medication." },
  { "term": "Atherosclerosis", "definition": "Hardening and narrowing of arteries caused by build-up of plaque (fatty deposits, cholesterol), reducing blood flow." },
  { "term": "Heart Failure (Congestive Heart Failure)", "definition": "Condition where the heart cannot pump enough blood to meet the body's needs, often causing fluid build-up." },
  { "term": "Left Ventricular Hypertrophy (LVH)", "definition": "Thickening of the walls of the heart’s left ventricle, often due to long-term high blood pressure or heart disease." },
  { "term": "Cardiomyopathy", "definition": "Disease of the heart muscle that reduces its ability to pump blood; can be dilated, hypertrophic, or restrictive type." },
  { "term": "Valvular Heart Disease", "definition": "Diseases affecting one or more of the heart valves, interfering with blood flow direction or volume." },
  { "term": "Aortic Stenosis", "definition": "Narrowing of the aortic valve opening, restricting blood flow from the heart into the aorta." },
  { "term": "Mitral Regurgitation", "definition": "Leakage of blood backward through the mitral valve each time the left ventricle contracts." },
  { "term": "Mitral Stenosis", "definition": "Narrowing of the mitral valve, obstructing blood flow from left atrium to left ventricle." },
  { "term": "Pericarditis", "definition": "Inflammation of the pericardium — the thin sac surrounding the heart." },
  { "term": "Endocarditis", "definition": "Infection or inflammation of the inner lining of the heart chambers and valves." },
  { "term": "Cardiac Arrest", "definition": "Sudden cessation of heart function — heart stops beating effectively." },
  { "term": "Congenital Heart Defect", "definition": "Structural problems with the heart present from birth (valve defects, septal defects, etc.)." },
  { "term": "Septal Defect", "definition": "Hole in the wall (septum) that separates left and right sides of the heart (e.g., ASD, VSD)." },
  { "term": "Patent Ductus Arteriosus (PDA)", "definition": "A persistent opening between two major blood vessels of the heart that fails to close after birth." },
  { "term": "Electrocardiogram (ECG / EKG)", "definition": "A test that records the electrical activity of the heart to identify arrhythmias, heart attack, etc." },
  { "term": "Echocardiography (Echo)", "definition": "Ultrasound imaging of the heart to assess structure, valves, blood flow, and function." },
  { "term": "Stress Test (Treadmill Test)", "definition": "Heart test under controlled physical exertion to evaluate blood flow, rhythm, and ischemia." },
  { "term": "Coronary Angiography", "definition": "Imaging test to visualize coronary arteries, used to detect blockages or narrowing." },
  { "term": "Coronary Angioplasty (Percutaneous Coronary Intervention)", "definition": "Procedure to open narrowed or blocked coronary arteries, often with stent placement." },
  { "term": "Coronary Artery Bypass Graft (CABG)", "definition": "Surgical procedure to restore blood flow to heart muscle by bypassing blocked coronary arteries." },
  { "term": "Pacemaker", "definition": "Implantable device that regulates abnormal heart rhythms by delivering timed electrical impulses." },
  { "term": "Implantable Cardioverter‑Defibrillator (ICD)", "definition": "Device implanted in heart to detect life-threatening arrhythmias and deliver shock to restore normal rhythm." },
  { "term": "Cardiac Catheterization", "definition": "Procedure to examine heart chambers, valves, and coronary arteries via a thin tube inserted into blood vessels." },
  { "term": "Cardiac Rehabilitation", "definition": "Program of exercise, education, and counseling to help patients recover from heart disease or surgery." },
  { "term": "Palpitations", "definition": "Sensation of rapid, fluttering, or pounding heartbeats — often sign of arrhythmia or stress." },
  { "term": "Syncope", "definition": "Temporary loss of consciousness (fainting) due to insufficient blood flow to the brain, sometimes from heart problems." },
  { "term": "Edema (Peripheral Edema)", "definition": "Swelling, often in legs/feet, caused by fluid build-up due to heart failure or poor circulation." },
  { "term": "Angiogenesis (Coronary)", "definition": "Formation of new blood vessels supplying the heart — natural or post-injury adaptation." },
  { "term": "Ischemia", "definition": "Lack of sufficient blood flow (and oxygen) to a part of the heart muscle — can cause angina or MI." },
  { "term": "Ischemic Heart Disease", "definition": "Heart problems caused by narrowed heart arteries resulting in reduced blood flow — includes angina and MI." },
  { "term": "Heart Murmur", "definition": "Extra or unusual sound heard during heartbeat — may indicate valve problem or other heart defect." },
  { "term": "Cardiogenic Shock", "definition": "Life-threatening condition where heart can’t pump enough blood to meet the body’s needs — often after MI." },
  { "term": "Congenital Heart Disease", "definition": "Any heart structural abnormality present at birth (septal defect, valve defect, vascular anomaly, etc.)." },
  { "term": "Left Bundle Branch Block (LBBB)", "definition": "Delay or block in electrical conduction on the left side of the heart — visible on ECG." },
  { "term": "Right Bundle Branch Block (RBBB)", "definition": "Delay or block in electrical conduction on the right side of the heart — visible on ECG." },
  { "term": "Cardiac Hypertrophy", "definition": "Thickening of heart muscle — often from chronic high blood pressure or valve disease." },
  { "term": "Pericardial Effusion", "definition": "Build-up of fluid in the pericardial sac around the heart — can impair heart function." },
  { "term": "Endocardial Fibrosis", "definition": "Abnormal thickening or scarring of the heart’s inner lining (endocardium), often affecting valves." },
  { "term": "Aneurysm (Cardiac / Aortic)", "definition": "Weakening and bulging of a heart/aorta wall — risk of rupture, blood flow issues." },
  { "term": "Cardiac Remodeling", "definition": "Structural changes of the heart (size, shape, function) after injury (like MI) or chronic stress." },
  { "term": "Rheumatic Heart Disease", "definition": "Heart valve damage resulting from rheumatic fever (infection-related), causing long-term heart issues." },
  { "term": "Peripartum Cardiomyopathy", "definition": "Heart muscle disease occurring during pregnancy or after delivery causing heart failure symptoms." },
  { "term": "Pulmonary Hypertension", "definition": "High blood pressure in the arteries of the lungs, which can strain the right side of the heart." },
  { "term": "Right Heart Failure", "definition": "Failure of the right ventricle to pump blood effectively, often causing swelling in the legs and abdomen." },
  { "term": "Left Heart Failure", "definition": "Failure of the left ventricle to pump blood effectively, leading to pulmonary congestion and shortness of breath." },
  { "term": "Biventricular Heart Failure", "definition": "Failure of both left and right ventricles, combining symptoms of both right and left heart failure." },
  { "term": "Heart Block", "definition": "Impairment in the heart’s electrical conduction system, slowing or preventing signals from reaching the ventricles." },
  { "term": "First-degree Heart Block", "definition": "Minor delay in electrical conduction through the AV node — usually asymptomatic." },
  { "term": "Second-degree Heart Block", "definition": "Some electrical signals fail to reach the ventricles — may cause dizziness or fainting." },
  { "term": "Third-degree Heart Block (Complete Heart Block)", "definition": "No electrical signals reach the ventricles — can cause severe bradycardia and syncope." },
  { "term": "Supraventricular Tachycardia (SVT)", "definition": "Rapid heart rate originating above the ventricles — often sudden onset and stops spontaneously." },
  { "term": "Ventricular Tachycardia (VT)", "definition": "Fast, abnormal heart rhythm originating in the ventricles — can lead to cardiac arrest if untreated." },
  { "term": "Ventricular Fibrillation (VF)", "definition": "Life-threatening irregular heart rhythm causing the ventricles to quiver instead of pumping — requires immediate defibrillation." },
  { "term": "Hypertrophic Cardiomyopathy", "definition": "Genetic condition causing abnormal thickening of the heart muscle, especially the septum, which can obstruct blood flow." },
  { "term": "Dilated Cardiomyopathy", "definition": "Heart chambers enlarge and weaken, reducing pumping efficiency and causing heart failure." },
  { "term": "Restrictive Cardiomyopathy", "definition": "Heart muscle becomes rigid, restricting filling of the ventricles while systolic function is preserved." },
  { "term": "Takotsubo Cardiomyopathy (Broken Heart Syndrome)", "definition": "Temporary heart muscle weakness often triggered by severe emotional or physical stress." },
  { "term": "Cardiac Amyloidosis", "definition": "Deposition of abnormal proteins in the heart, leading to stiffening and heart failure." },
  { "term": "Pulmonary Embolism (PE)", "definition": "Blockage of a pulmonary artery by a blood clot, causing sudden shortness of breath and possible right heart strain." },
  { "term": "Deep Vein Thrombosis (DVT)", "definition": "Formation of a blood clot in deep veins (usually legs) that can travel to the lungs and cause PE." },
  { "term": "Cor Pulmonale", "definition": "Right-sided heart failure due to chronic lung disease or pulmonary hypertension." },
  { "term": "Aortic Dissection", "definition": "Tear in the inner layer of the aorta wall, causing life-threatening bleeding into the vessel wall." },
  { "term": "Marfan Syndrome", "definition": "Genetic disorder affecting connective tissue, often causing aortic enlargement and valve issues." },
  { "term": "Eisenmenger Syndrome", "definition": "Long-standing congenital heart defect causing pulmonary hypertension and reversal of blood flow." },
  { "term": "Shock (Cardiogenic / Hypovolemic / Septic)", "definition": "Life-threatening condition of inadequate tissue perfusion; cardiogenic shock is specifically due to heart failure." },
  { "term": "Heart Transplant", "definition": "Surgical replacement of a diseased heart with a donor heart in patients with end-stage heart failure." },
  { "term": "Left Ventricular Assist Device (LVAD)", "definition": "Mechanical pump that helps the left ventricle pump blood in patients awaiting heart transplant or with severe heart failure." },
  { "term": "Extracorporeal Membrane Oxygenation (ECMO)", "definition": "Life-support machine that oxygenates blood outside the body for patients with severe cardiac or pulmonary failure." },
  { "term": "Cardio-oncology", "definition": "Field focused on managing heart disease risk in cancer patients undergoing chemotherapy or radiation." },
  { "term": "Heart Rate Variability (HRV)", "definition": "Variation in time between heartbeats — used as a measure of autonomic nervous system activity and cardiac health." },
  { "term": "Coronary Microvascular Disease", "definition": "Small vessel disease of the heart causing angina-like symptoms without large artery blockage." },
  { "term": "Takayasu Arteritis", "definition": "Inflammatory disease affecting large arteries including the aorta, leading to narrowing and possible heart complications." },
  { "term": "Aneurysm (Ventricular)", "definition": "Bulging of the ventricular wall, often after myocardial infarction, which may impair function or rupture." },
  { "term": "Aneurysm (Cerebral/Cardiac link)", "definition": "Weakening of arteries supplying the brain or heart, increasing risk of rupture or stroke." },
  { "term": "Atrial Tachycardia", "definition": "Rapid heartbeat originating from the atria, distinct from atrial fibrillation or flutter." },
  { "term": "AV Nodal Reentrant Tachycardia (AVNRT)", "definition": "Common type of supraventricular tachycardia caused by a reentry circuit in the AV node." },
  { "term": "Bicuspid Aortic Valve", "definition": "Congenital condition where the aortic valve has two leaflets instead of three, can lead to stenosis or regurgitation." },
  { "term": "Bundle Branch Reentry Tachycardia", "definition": "Rare ventricular tachycardia due to reentry circuit within bundle branches." },
  { "term": "Cardiac Allograft Vasculopathy", "definition": "Chronic narrowing of coronary arteries after heart transplant." },
  { "term": "Cardiac Conduction Disease", "definition": "Any abnormality in the electrical pathways of the heart causing arrhythmias or blocks." },
  { "term": "Cardiac Fibrosis", "definition": "Excess fibrous tissue in the heart muscle, leading to stiffness and impaired function." },
  { "term": "Cardiac Glycosides", "definition": "Medications (like digoxin) that increase heart contractility, used in heart failure and AFib." },
  { "term": "Chagas Disease (Cardiac)", "definition": "Parasitic infection leading to cardiomyopathy and arrhythmias." },
  { "term": "Claudication (Cardiac-related Peripheral)", "definition": "Pain in limbs due to reduced blood flow from atherosclerosis; may indicate systemic vascular disease." },
  { "term": "Coronary Spasm (Prinzmetal Angina)", "definition": "Temporary narrowing of coronary arteries causing chest pain, often at rest." },
  { "term": "Cryoablation", "definition": "Procedure using extreme cold to destroy abnormal heart tissue causing arrhythmia." },
  { "term": "Decompensated Heart Failure", "definition": "Acute worsening of chronic heart failure symptoms requiring urgent intervention." },
  { "term": "Diastolic Dysfunction", "definition": "Impaired relaxation of the ventricles, often leading to heart failure with preserved ejection fraction." },
  { "term": "Endocardial Cushion Defect", "definition": "Congenital malformation affecting atrial and ventricular septa and valves." },
  { "term": "Epicardial Fat", "definition": "Fat deposits on the heart surface associated with coronary artery disease risk." },
  { "term": "Exercise-induced Arrhythmia", "definition": "Abnormal heart rhythm triggered by physical activity." },
  { "term": "Familial Hypercholesterolemia (Cardiac risk)", "definition": "Genetic disorder causing high LDL cholesterol and premature coronary artery disease." },
  { "term": "Fatty Heart Infiltration", "definition": "Replacement of heart muscle with fat tissue, potentially affecting conduction and function." },
  { "term": "Heart Block (Intermittent)", "definition": "Occasional failure of electrical signals to pass through AV node." },
  { "term": "Heart Rate Recovery Index", "definition": "Measure of autonomic function based on heart rate drop after exercise." },
  { "term": "Heart Valve Calcification", "definition": "Calcium deposits on valves reducing flexibility, can cause stenosis or regurgitation." },
  { "term": "Hemodynamic Monitoring", "definition": "Continuous measurement of blood pressure, cardiac output, and other parameters." },
  { "term": "Holter Monitoring", "definition": "24–48 hour portable ECG monitoring to detect intermittent arrhythmias." },
  { "term": "Hypokalemia-induced Arrhythmia", "definition": "Irregular heartbeat caused by low potassium levels affecting cardiac conduction." },
  { "term": "Idiopathic Pulmonary Arterial Hypertension", "definition": "High blood pressure in pulmonary arteries with unknown cause." },
  { "term": "Inflammatory Cardiomyopathy", "definition": "Heart muscle inflammation leading to impaired function, often from viral infection." },
  { "term": "Isolated Right Ventricular Cardiomyopathy", "definition": "Disease affecting only the right ventricle, often leading to arrhythmias." },
  { "term": "Left Atrial Enlargement", "definition": "Increase in left atrial size, often due to hypertension or valve disease." },
  { "term": "Left Ventricular Noncompaction", "definition": "Rare congenital cardiomyopathy with spongy left ventricular muscle." },
  { "term": "Long QT Syndrome", "definition": "Genetic disorder causing prolonged QT interval on ECG, increasing risk of sudden cardiac death." },
  { "term": "MacCallum Plaque", "definition": "Patch of fibrosis in atrium seen in rheumatic heart disease." },
  { "term": "Mitral Annular Calcification", "definition": "Calcium deposits in mitral valve ring, can impair valve function." },
  { "term": "Myocarditis", "definition": "Inflammation of heart muscle, often viral or autoimmune in origin." },
  { "term": "Neonatal Tachycardia", "definition": "Abnormally fast heart rate in newborns." },
  { "term": "Paroxysmal Atrial Fibrillation", "definition": "AFib episodes that start and stop spontaneously." },
  { "term": "Patent Foramen Ovale (PFO)", "definition": "Small hole between atria that persists after birth, sometimes causing stroke or migraine." },
  { "term": "Peripartum Heart Disease", "definition": "Heart dysfunction related to pregnancy, including peripartum cardiomyopathy." },
  { "term": "Pulmonary Embolism-induced Right Heart Strain", "definition": "Pressure overload on right ventricle due to obstruction in pulmonary arteries." },
  { "term": "Pulmonary Valve Regurgitation", "definition": "Backward flow of blood through pulmonary valve, often post-surgical or congenital." },
  { "term": "QT Prolongation (Drug-induced)", "definition": "Lengthening of QT interval caused by certain medications, increasing arrhythmia risk." },
  { "term": "Sick Sinus Syndrome", "definition": "Dysfunction of the sinus node causing bradycardia, pauses, or alternating slow and fast rhythms." },
  { "term": "Torsades de Pointes", "definition": "Specific type of ventricular tachycardia associated with prolonged QT interval." },
  { "term": "Transposition of Great Arteries (TGA)", "definition": "Congenital defect where the aorta and pulmonary artery are reversed, requiring surgery." },
  { "term": "Tricuspid Atresia", "definition": "Congenital absence or closure of tricuspid valve leading to hypoplastic right ventricle." },
  { "term": "Tricuspid Regurgitation", "definition": "Backflow of blood through tricuspid valve during ventricular contraction." },
  { "term": "Ventricular Septal Defect (VSD, Large)", "definition": "Large hole in ventricular septum causing significant left-to-right shunt." },
  { "term": "Wolf-Parkinson-White Syndrome (WPW)", "definition": "Pre-excitation syndrome causing abnormal electrical pathways and tachyarrhythmias." },
  { "term": "Atrial Flutter", "definition": "Rapid but regular atrial contractions, often resulting in fast ventricular rate." },
  { "term": "Cardiomyopathy (Arrhythmogenic Right Ventricular)", "definition": "Replacement of right ventricular myocardium with fibrofatty tissue, predisposing to VT." },
  { "term": "Cardioverter Defibrillator (External)", "definition": "Portable device used to deliver electrical shock to restore normal heart rhythm in emergencies." },
  { "term": "Endocarditis (Prosthetic Valve)", "definition": "Infection of a heart valve replacement device." },
  { "term": "Heart Failure with Preserved Ejection Fraction (HFpEF)", "definition": "Heart failure where ejection fraction is normal but diastolic dysfunction is present." },
  { "term": "Heart Failure with Reduced Ejection Fraction (HFrEF)", "definition": "Heart failure with low ejection fraction, indicating systolic dysfunction." },
  { "term": "Left Ventricular Outflow Tract Obstruction", "definition": "Obstruction in the path from left ventricle to aorta, often in hypertrophic cardiomyopathy." },
  { "term": "Mitral Valve Prolapse Syndrome", "definition": "Floppy mitral valve causing regurgitation, sometimes arrhythmia, or palpitations." },
  { "term": "Noncompaction Cardiomyopathy", "definition": "Congenital condition where ventricular myocardium has deep trabeculations." },
  { "term": "Paroxysmal Supraventricular Tachycardia (PSVT)", "definition": "Intermittent episodes of rapid heartbeat originating above the ventricles." },
  { "term": "Pulmonary Arterial Hypertension (PAH)", "definition": "High blood pressure in pulmonary arteries due to vascular disease." },
  { "term": "Right Ventricular Hypertrophy", "definition": "Thickening of the right ventricular wall, often from pulmonary hypertension." },
  { "term": "Sinus Tachycardia", "definition": "Fast heart rate originating from the sinus node, often physiologic." },
  { "term": "Sinus Bradycardia", "definition": "Slow heart rate originating from the sinus node." },
  { "term": "Supraventricular Premature Beat (PAC)", "definition": "Extra heartbeat originating in the atria, usually benign." },
  { "term": "Ventricular Premature Beat (VPB)", "definition": "Extra heartbeat originating in the ventricles, may cause palpitations." },
  { "term": "Left Ventricular Strain", "definition": "Changes in ECG or imaging indicating increased left ventricular workload, often from hypertension." },
  { "term": "Right Ventricular Strain", "definition": "Signs of increased right ventricular workload, often from pulmonary embolism or pulmonary hypertension." },
  { "term": "Pulmonary Valve Stenosis", "definition": "Narrowing of the pulmonary valve, causing right ventricular pressure overload." },
  { "term": "Aortic Regurgitation", "definition": "Backflow of blood from the aorta into the left ventricle during diastole." },
  { "term": "Acute Coronary Syndrome (ACS)", "definition": "Range of conditions including unstable angina and myocardial infarction due to sudden coronary artery blockage." },
  { "term": "Coronary Slow Flow Phenomenon", "definition": "Delayed coronary blood flow without large vessel obstruction, causing angina." },
  { "term": "Cardiopulmonary Exercise Testing (CPET)", "definition": "Measures heart and lung function during exercise to assess cardiovascular fitness." },
  { "term": "Left Atrial Appendage Occlusion", "definition": "Procedure to close left atrial appendage to reduce stroke risk in AFib." },
  { "term": "CardioMEMS Device", "definition": "Implantable sensor that monitors pulmonary artery pressure in heart failure patients." },
  { "term": "Myocardial Bridging", "definition": "Segment of a coronary artery tunneled under heart muscle, potentially causing ischemia." },
  { "term": "Stress Cardiomyopathy", "definition": "Transient heart muscle dysfunction often triggered by stress (includes Takotsubo syndrome)." },
  { "term": "Coronary Artery Ectasia", "definition": "Abnormal dilation of coronary arteries, potentially causing ischemia or thrombosis." },
  { "term": "Cardiac Sarcoidosis", "definition": "Granulomatous inflammation of heart tissue, which can cause arrhythmias and heart failure." },
  { "term": "Pericardial Constriction", "definition": "Thickened or scarred pericardium restricting heart filling." },
  { "term": "Pulmonary Vein Isolation (PVI)", "definition": "Procedure to prevent atrial fibrillation by ablating abnormal electrical pathways in pulmonary veins." },
  { "term": "Cardiac Tumors", "definition": "Rare growths in the heart, benign (myxoma) or malignant (angiosarcoma)."},
  { "term": "Left Ventricular Dyssynchrony", "definition": "Uncoordinated contraction of left ventricle, often treated with biventricular pacing." },
  { "term": "Right Atrial Enlargement", "definition": "Increase in size of right atrium due to pressure or volume overload." },
  { "term": "Coronary Artery Anomalies", "definition": "Congenital abnormal origin or path of coronary arteries, sometimes causing ischemia." },
  { "term": "Cardiomyopathy (Stress-induced)", "definition": "Temporary heart muscle weakness caused by physical or emotional stress." },
  { "term": "Ventricular Dyssynchrony", "definition": "Asynchronous contraction of ventricles, may worsen heart failure." },
  { "term": "Hyperdynamic Circulation", "definition": "Increased cardiac output due to conditions like anemia or thyrotoxicosis." },
  { "term": "Cardiac Tumor (Myxoma)", "definition": "Benign tumor usually in the left atrium that can obstruct blood flow." },
  { "term": "Pulmonary Capillary Wedge Pressure (PCWP)", "definition": "Measurement reflecting left atrial pressure, used in heart failure evaluation." },
  { "term": "Pericardial Knock", "definition": "Early diastolic sound associated with constrictive pericarditis." },
  { "term": "Brugada Syndrome", "definition": "Genetic disorder causing abnormal ECG patterns and increased risk of sudden cardiac death." }

]


